Repository: kingcos/OpenVibble
Catalog: OpenVibbleDesktop/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# desktop.overview.hooksCTA.title
source: Hooks not registered
zh_hans: Hooks 尚未注册

# desktop.overview.hooksCTA.desc
source: Claude Code won't forward events to OpenVibble until you register hooks in ~/.claude/settings.json. This is reversible.
zh_hans: Claude Code 需要在 ~/.claude/settings.json 注册 hooks 后才会把事件转发给 OpenVibble。该操作可随时撤销。

# desktop.bt.off
source: Bluetooth is off
zh_hans: 蓝牙已关闭

# desktop.bt.on
source: Bluetooth is on
zh_hans: 蓝牙已开启

# desktop.bt.unauth
source: Bluetooth permission denied
zh_hans: 蓝牙权限被拒绝

# desktop.bt.unsupported
source: Bluetooth not supported
zh_hans: 此设备不支持蓝牙

# desktop.bt.resetting
source: Bluetooth resetting
zh_hans: 蓝牙正在重置

# desktop.bt.unknown
source: Bluetooth state unknown
zh_hans: 蓝牙状态未知

# desktop.about
source: About
zh_hans: 关于

# desktop.about.author
source: Author
zh_hans: 作者

# desktop.about.license
source: Open source under Apache-2.0
zh_hans: 基于 Apache-2.0 开源

# desktop.about.repo
source: GitHub repository
zh_hans: GitHub 仓库

# desktop.about.tagline
source: An open-source desktop companion for Claude iOS Buddy.
zh_hans: 为 Claude iOS Buddy 打造的开源桌面端。

# desktop.about.version
source: Version %1$@ (%2$@)
zh_hans: 版本 %1$@（%2$@）

# desktop.activity
source: Activity
zh_hans: 活动日志

# desktop.activity.clear
source: Clear
zh_hans: 清空

# desktop.battery
source: Battery
zh_hans: 电量

# desktop.battery.pct
source: Level
zh_hans: 电量

# desktop.battery.voltage
source: Voltage
zh_hans: 电压

# desktop.bridge.baseUrl
source: Base URL
zh_hans: 基础 URL

# desktop.bridge.copied
source: Copied
zh_hans: 已复制

# desktop.bridge.copy
source: Copy
zh_hans: 复制

# desktop.bridge.endpoints
source: Endpoints
zh_hans: 端点

# desktop.bridge.exampleCurl
source: Example curl
zh_hans: curl 示例

# desktop.bridge.intro
source: OpenVibbleDesktop bridges local HTTP events to the iOS buddy over Bluetooth. Any agent that can POST JSON to localhost can integrate.
zh_hans: OpenVibbleDesktop 通过本地 HTTP 把事件桥接到蓝牙桌宠。任何能向本机 POST JSON 的 agent 都可接入。

# desktop.bridge.notReady
source: Bridge not ready
zh_hans: 桥接未就绪

# desktop.bridge.portFile
source: Port file
zh_hans: 端口文件

# desktop.bridge.token
source: Token
zh_hans: 令牌

# desktop.btn.approve
source: Approve
zh_hans: 同意

# desktop.btn.cancel
source: Cancel
zh_hans: 取消

# desktop.btn.close
source: Close
zh_hans: 关闭

# desktop.btn.connect
source: Connect
zh_hans: 连接

# desktop.btn.deny
source: Deny
zh_hans: 拒绝

# desktop.btn.disconnect
source: Disconnect
zh_hans: 断开

# desktop.btn.scan
source: Scan
zh_hans: 扫描

# desktop.btn.send
source: Send
zh_hans: 发送

# desktop.btn.stop
source: Stop
zh_hans: 停止

# desktop.cmd.name
source: Name
zh_hans: 名称

# desktop.cmd.owner
source: Owner
zh_hans: 主人

# desktop.cmd.status
source: Request status
zh_hans: 请求状态

# desktop.cmd.time
source: Sync time
zh_hans: 同步时间

# desktop.cmd.unpair
source: Unpair
zh_hans: 解绑

# desktop.device
source: Device
zh_hans: 设备

# desktop.device.name
source: Name
zh_hans: 名称

# desktop.device.none
source: Not connected. Click Connect to scan for a Claude device.
zh_hans: 未连接。点击连接扫描 Claude 设备。

# desktop.device.security
source: Security
zh_hans: 加密

# desktop.device.unencrypted
source: Unencrypted
zh_hans: 未加密

# desktop.header.connected
source: Connected
zh_hans: 已连接

# desktop.header.connecting
source: Connecting…
zh_hans: 正在连接…

# desktop.header.disconnecting
source: Disconnecting…
zh_hans: 正在断开…

# desktop.header.error
source: Error: %@
zh_hans: 错误：%@

# desktop.header.idle
source: Idle
zh_hans: 空闲

# desktop.header.scanning
source: Scanning…
zh_hans: 扫描中…

# desktop.header.startup
source: Starting up…
zh_hans: 启动中…

# desktop.header.unauth
source: Bluetooth permission denied
zh_hans: 蓝牙权限被拒绝

# desktop.header.unsupported
source: Bluetooth not supported
zh_hans: 此设备不支持蓝牙

# desktop.hooks.bleAction
source: BLE: %@
zh_hans: 蓝牙：%@

# desktop.hooks.empty
source: No activity yet
zh_hans: 暂无活动

# desktop.hooks.lastFired
source: Last fired %@
zh_hans: 上次触发 %@

# desktop.hooks.notification.desc
source: Claude Code system-level notifications.
zh_hans: Claude Code 系统级通知事件。

# desktop.hooks.notification.title
source: Notification
zh_hans: 系统通知

# desktop.hooks.petState
source: Pet: %@
zh_hans: 宠物:%@

# desktop.hooks.preToolUse.desc
source: Fires before every tool call. Observation only — does not block.
zh_hans: 每次工具调用前触发，仅观察，不阻塞。

# desktop.hooks.preToolUse.title
source: PreToolUse
zh_hans: 工具调用前

# desktop.hooks.permissionRequest.title
source: PermissionRequest
zh_hans: 权限请求

# desktop.hooks.permissionRequest.desc
source: When Claude Code needs your approval. Blocks up to 30s waiting for your decision from the buddy.
zh_hans: Claude Code 请求权限时触发，最多阻塞 30 秒等待桌宠侧的决策。

# desktop.hooks.stopFailure.title
source: StopFailure
zh_hans: 异常结束

# desktop.hooks.stopFailure.desc
source: When a turn ends due to an API error.
zh_hans: 因 API 错误等原因导致本轮对话异常结束。

# desktop.hooks.sessionStart.title
source: SessionStart
zh_hans: 会话开始

# desktop.hooks.sessionStart.desc
source: When a new Claude Code session begins or resumes.
zh_hans: 新的 Claude Code 会话开启或恢复时触发。

# desktop.hooks.sessionEnd.title
source: SessionEnd
zh_hans: 会话结束

# desktop.hooks.sessionEnd.desc
source: When a Claude Code session terminates.
zh_hans: Claude Code 会话终止时触发。

# desktop.hooks.subagentStart.title
source: SubagentStart
zh_hans: 子代理开始

# desktop.hooks.subagentStart.desc
source: When a subagent spawns. Great signal for parallel work.
zh_hans: 子代理启动时触发，常用于并行任务信号。

# desktop.hooks.subagentStop.title
source: SubagentStop
zh_hans: 子代理结束

# desktop.hooks.subagentStop.desc
source: When a subagent finishes.
zh_hans: 子代理结束时触发。

# desktop.hooks.register
source: Register hooks
zh_hans: 注册 hooks

# desktop.hooks.status.notRegistered
source: Not registered
zh_hans: 未注册

# desktop.hooks.status.partial
source: Partially registered
zh_hans: 部分注册

# desktop.hooks.status.registered
source: Registered
zh_hans: 已注册

# desktop.hooks.stop.desc
source: Fires when Claude Code finishes a response.
zh_hans: Claude Code 完成一次回复时触发。

# desktop.hooks.stop.title
source: Stop
zh_hans: 回合结束

# desktop.hooks.todayCount
source: Today: %d
zh_hans: 今日：%d

# desktop.hooks.unregister
source: Unregister
zh_hans: 注销

# desktop.hooks.userPromptSubmit.desc
source: Fires when you send a message to Claude Code.
zh_hans: 你向 Claude Code 发消息时触发。

# desktop.hooks.userPromptSubmit.title
source: UserPromptSubmit
zh_hans: 用户提交

# desktop.install
source: Install character
zh_hans: 安装角色

# desktop.install.cancel
source: Cancel install
zh_hans: 取消安装

# desktop.install.hint
source: Pick a folder whose files will be pushed to the device as a character pack.
zh_hans: 选择一个文件夹，其中的文件将作为角色包推送到设备。

# desktop.install.pick
source: Pick folder…
zh_hans: 选择文件夹…

# desktop.install.progress
source: %1$@ · file %2$d/%3$d · %4$d bytes
zh_hans: %1$@ · 文件 %2$d/%3$d · %4$d 字节

# desktop.install.start
source: Start install
zh_hans: 开始安装

# desktop.install.title
source: Character pack name
zh_hans: 角色包名称

# desktop.lang
source: Language
zh_hans: 语言

# desktop.lang.system
source: System
zh_hans: 跟随系统

# desktop.manual
source: Manual events
zh_hans: 手动事件

# desktop.menu.open
source: Open window
zh_hans: 打开主窗口

# desktop.menu.quit
source: Quit OpenVibbleDesktop
zh_hans: 退出 OpenVibbleDesktop

# desktop.menu.scan.start
source: Start scanning
zh_hans: 开始扫描

# desktop.menu.scan.stop
source: Stop scanning
zh_hans: 停止扫描

# desktop.menu.summary.connected
source: Connected · %@
zh_hans: 已连接 · %@

# desktop.menu.summary.scanning
source: Scanning for Claude…
zh_hans: 正在扫描…

# desktop.overview.petState
source: Pet state
zh_hans: 宠物状态

# desktop.overview.recentHooks
source: Recent hook events
zh_hans: 最近 hook 事件

# desktop.pending
source: Pending prompt
zh_hans: 待处理请求

# desktop.pending.hint
source: Hint
zh_hans: 提示

# desktop.pending.none
source: No prompt is waiting.
zh_hans: 当前没有等待中的请求。

# desktop.pending.project
source: Project: %@
zh_hans: 项目：%@

# desktop.pending.title
source: Waiting for approval
zh_hans: 等待审批

# desktop.pending.tool
source: Tool
zh_hans: 工具

# desktop.placeholder.name
source: Name
zh_hans: 名称

# desktop.placeholder.owner
source: Owner
zh_hans: 主人

# desktop.placeholder.pack
source: pack name
zh_hans: 角色包名称

# desktop.scan.count
source: %d found
zh_hans: 发现 %d 台

# desktop.scan.empty.default
source: No devices yet — tap Scan.
zh_hans: 暂无设备 — 点击扫描。

# desktop.scan.empty.poweredOff
source: Bluetooth is off
zh_hans: 蓝牙已关闭

# desktop.scan.empty.scanning
source: Scanning… make sure the iOS app is open and broadcasting.
zh_hans: 扫描中……请确认 iOS 应用已打开并正在广播。

# desktop.scan.empty.unauth
source: Bluetooth permission denied
zh_hans: 蓝牙权限被拒绝

# desktop.scan.empty.unsupported
source: Bluetooth not supported on this Mac
zh_hans: 此 Mac 不支持蓝牙

# desktop.scan.subtitle
source: Devices advertising as “Claude” will appear here.
zh_hans: 名称前缀为 “Claude” 的设备会显示在这里。

# desktop.scan.title
source: Nearby Claude devices
zh_hans: 附近的 Claude 设备

# desktop.session
source: Sessions
zh_hans: 会话

# desktop.session.counts
source: total %1$d · running %2$d · waiting %3$d
zh_hans: 总计 %1$d · 运行 %2$d · 等待 %3$d

# desktop.session.tokensFmt
source: %1$d total · %2$d today
zh_hans: 总计 %1$d · 今日 %2$d

# desktop.settings.about
source: About
zh_hans: 关于

# desktop.settings.language
source: Language
zh_hans: 语言

# desktop.species
source: Species
zh_hans: 物种

# desktop.species.gif
source: GIF (installed pack)
zh_hans: GIF（已安装角色）

# desktop.stats
source: Stats
zh_hans: 数据

# desktop.stats.approved
source: Approved
zh_hans: 已通过

# desktop.stats.level
source: Level
zh_hans: 等级

# desktop.stats.velocity
source: Velocity
zh_hans: 速率

# desktop.stats.velocity.sec
source: %d s
zh_hans: %d 秒

# desktop.system
source: System
zh_hans: 系统

# desktop.system.fw
source: Firmware
zh_hans: 固件

# desktop.system.uptime
source: Uptime
zh_hans: 在线时长

# desktop.system.xfer
source: Transfer
zh_hans: 传输

# desktop.tab.bridge
source: Bridge API
zh_hans: 桥接说明

# desktop.tab.hooks
source: Hooks
zh_hans: 钩子

# desktop.tab.overview
source: Overview
zh_hans: 概览

# desktop.tab.settings
source: Settings
zh_hans: 设置

# desktop.tab.testPanel
source: Test Panel
zh_hans: 测试面板

# desktop.xfer.stats
source: rx %1$d · tx %2$d
zh_hans: 接收 %1$d · 发送 %2$d
